Revit 2026 API

# MultiReferenceAnnotationOptions Methods

---

The MultiReferenceAnnotationOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | ElementsMatchReferenceCategory |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAdditionalReferencesToDimension | Gets the additional references which the dimension will witness. |
|  | GetElementsToDimension | Gets the elements which the dimension will witness. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsAllowedDimensionStyleType | Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations. |
|  | ReferencesDontMatchReferenceCategory |  |
|  | SetAdditionalReferencesToDimension |  |
|  | SetElementsToDimension |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace